package awsJava.javaBasic;

public class A005_variable {

    public static void main(String[] args) {

    }
}
/*
 * 10+20 = 30
 * x = 5// x라는 변수(저장공간)
 * //x(미지수) == 변수(저장공간) / = ==  저장(넣겠다.) / 5 == (값,데이터)
 * 10 + x = 15
 *
 * x = 5; / x == 변수
 * y = x + 10; / x == 5 ==  값, y == 변수
 * = => 같다가 아니라 넣겠다는 대입의 의미이다(대입연산자)
 * System.out.println("y"); -> 알파벳 그대로
 * System.out.println(y); / y == 값
 *
 *
 * 변수(왼쪽) = 값(오른쪽 or 왼쪽이 아닌 것)
 * 모든 문장에는 ;을 붙여야함
 *
 * int x = 5; // 변수 선언
 * int y = x + 10; // 변수 선언
 * 처음 만들어진 숫자 정수를 담을 변수에 int를 붙여준다.
 * 만들때만 붙여준다.
 * 변수 이름은 겹칠 수 없다.
 * 숫자로만 이루어지면 안되고 숫자가 먼저 올 수 없다.
 * 띄어쓰기는 들어가지 못한다.
 * 띄어쓰기는 _로 대체한다.
 * 또는 단어와 단어가 합해질때 2번째 단어 첫글짜부더 앞에 문다만 대문자료 표한한다 redTable > 카멜 표기법
 * java 변수 네이밍 규칙
 *
 *
 * 자바 연산자, 자바 변수, 자바 변수 명명 규칙(정리할 것)
 */
